/*************************************************************************
*  	文件名称:  	Hal_KeyLed.c
*  	文件描述:  	蜂鸣器初始化
*  	历史记录:
*  	创建时间:  	2024-08-14
*  	创建人:  	何凤龙
*  	修改时间:
*	修改人:
*   描述:
*************************************************************************/

/*************************************************************************
头文件引用声明
*************************************************************************/
#include    "at32f435_437_gpio.h"
#include    "at32f435_437_scfg.h"
#include    "Hal_Buzzer.h"
/************************************************************************
宏定义
*************************************************************************/

/*************************************************************************
内部结构、枚举、公用体等结构声明
*************************************************************************/

/*************************************************************************
内部静态变量定义

全局变量定义

extern 外部变量声明

*************************************************************************/

/*************************************************************************
静态函数声明

extern 外部函数声明
*************************************************************************/

/*************************************************************************
函数定义
*************************************************************************/
/*----------------------------------------------------------------------------
函数名称： Hal_Buz_Init
具体描述： 蜂鸣器初始化
----------------------------------------------------------------------------*/
void Hal_Buz_Init(void)
{
	gpio_init_type  gpio_init_struct;

	gpio_default_para_init(&gpio_init_struct);

	gpio_init_struct.gpio_drive_strength = GPIO_DRIVE_STRENGTH_MODERATE;
	gpio_init_struct.gpio_mode = GPIO_MODE_OUTPUT;
	gpio_init_struct.gpio_pull = GPIO_PULL_UP;
	gpio_init_struct.gpio_pins = IO_BUZ_EN;
	gpio_init(PT_BUZ_EN, &gpio_init_struct);

}

/*----------------------------------------------------------------------------
函数名称： Hal_Buz_Init
具体描述： 蜂鸣器反初始化
----------------------------------------------------------------------------*/
void Hal_Buz_Deinit(void)
{
	gpio_init_type  gpio_init_struct;

	gpio_default_para_init(&gpio_init_struct);

	gpio_init_struct.gpio_drive_strength = GPIO_DRIVE_STRENGTH_MODERATE;
	gpio_init_struct.gpio_mode = GPIO_MODE_INPUT;
	gpio_init_struct.gpio_pull = GPIO_PULL_NONE;
	gpio_init_struct.gpio_pins = IO_BUZ_EN;
	gpio_init(PT_BUZ_EN, &gpio_init_struct);

}

/*----------------------------------------------------------------------------
函数名称： Hal_Buz_On
具体描述： 蜂鸣器启动
----------------------------------------------------------------------------*/
void Hal_Buz_On(void)
{
	//BUZ_ON();
	uint8_t state_led = 0;
  state_led = gpio_output_data_bit_read(PT_BUZ_EN, IO_BUZ_EN);
  if(state_led)
  {
      gpio_bits_write(PT_BUZ_EN, IO_BUZ_EN,FALSE);
  }
  else
  {
      gpio_bits_write(PT_BUZ_EN, IO_BUZ_EN,TRUE);
  }
}
/*----------------------------------------------------------------------------
函数名称： Hal_Buz_Off
具体描述： 蜂鸣器启动
----------------------------------------------------------------------------*/
void Hal_Buz_Off(void)
{
	BUZ_OFF();
}











